tap "databricks/tap"
tap "hashicorp/tap"
tap "minamijoyo/hcledit"
brew "tree"
brew "ansible"
brew "aspell"
brew "bat"
brew "checkov"
brew "colima"
brew "docker"
brew "glab"
brew "hcl2json"
brew "infracost"
brew "jq"
brew "jump"
brew "node@22"
brew "openldap"
brew "pre-commit"
brew "pyenv",
    postinstall: "${HOMEBREW_PREFIX}/bin/pyenv install 3.12 || true"
brew "terraform-docs"
brew "terrascan"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tfupdate"
brew "tmux"
brew "trivy"
brew "universal-ctags"
brew "urlview"
brew "wget"
brew "databricks/tap/databricks"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/tf-migrate"
brew "hashicorp/tap/vault"
brew "minamijoyo/hcledit/hcledit"
brew("gemini-cli",
    postinstall: "pip install google-genai") if File.exist?(File.expand_path("~/.brew_use_gemini"))
cask "1password-cli"
cask "aws-vault-binary"
cask "copilot-cli"
